package utils

func RemoteMap1() (m map[int]int) {
	m = make(map[int]int)
	m[1] = 5    //伸一级护帮
	m[2] = 20   //伸二级护帮
	m[4] = 22   //伸三级护帮
	m[8] = 4    //推溜
	m[16] = 0   //伸伸缩梁（无命令）
	m[32] = 7   //伸前梁（无命令）
	m[64] = 14  //伸侧护帮
	m[128] = 1  //升柱
	m[256] = 10 //伸平衡
	m[512] = 16 //伸底调
	m[1024] = 0 //伸尾梁
	m[2048] = 0 //伸插板
	m[4096] = 0 //拉后溜
	return
}

func RemoteMap2() (m map[int]int) {
	m = make(map[int]int)
	m[2] = 9      //起底
	m[4] = 44     //急停
	m[64] = 18    //降柱抬底
	m[128] = 0    //自动跟机
	m[256] = 6    //收一级护帮
	m[512] = 21   //收二级护帮
	m[1024] = 23  //收三级护帮
	m[2048] = 3   //移架
	m[4096] = 0   //收伸缩梁
	m[8192] = 8   //收前梁
	m[16384] = 15 //收侧护板
	m[32768] = 2  //降柱
	return
}

func RemoteMap3() (m map[int]int) {
	m = make(map[int]int)
	m[1] = 11     //收平衡
	m[2] = 17     //收底调
	m[4] = 0      //收尾梁
	m[8] = 0      //收插板
	m[512] = 12   //开前喷雾
	m[1024] = 12  //开后喷雾
	m[16384] = 0  //自动移架
	m[32768] = 13 //抬底移架
	return
}
